src/СРМ/src/Catalogs/ЦПР_Подключения/ЦПР_Подключения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЦПР_Подключения</name>
  <comment>Справчоник определяющий все варианты и способы подключения к компьютерам</comment>
  <owners>Catalog.ЦПР_ТочкиПодключения</owners>
  <attributes>
    <name>ВидПодключения</name>
    <type>
      <types>CatalogRef.ЦПР_ВидыПодключений</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредварительноеПодключение</name>
    <type>
      <types>CatalogRef.ЦПР_Подключения</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/СРМ/src/InformationRegisters/ЦПР_УчетныеДанныеПодключений/ЦПР_УчетныеДанныеПодключений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦПР_УчетныеДанныеПодключений</name>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Администратор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ЦПР_ВидыУчетныхДанных</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПроверкаПодключения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТочкаПодключения</name>
    <type>
      <types>CatalogRef.ЦПР_Подключения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/СРМ/src/Catalogs/ЦПР_Подключения/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура УстановитьАдресПодключения()
	Объект.АдресПодключения=Справочники.ЦПР_Подключения.ПолучитьАдресПодключения(Объект.Адрес,объект.Порт);	
КонецПроцедуры

&НаКлиенте
Процедура АдресПриИзменении(Элемент)
	УстановитьАдресПодключения();
КонецПроцедуры

&НаКлиенте
Процедура ПортПриИзменении(Элемент)
	УстановитьАдресПодключения();
КонецПроцедуры

&НаКлиенте
Процедура ВипПодключенияПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	Элементы.ГруппаПарольДляПодключенийБезЛогина.Видимость=Объект.ВидПодключения.БезЛогина;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	Если ТекущийОбъект.ВидПодключения.БезЛогина Тогда
		МенеджерЧтения=РегистрыСведений.ЦПР_УчетныеДанныеПодключений.СоздатьМенеджерЗаписи();
		МенеджерЧтения.Логин="";
		МенеджерЧтения.ТочкаПодключения=ТекущийОбъект.Ссылка;
		МенеджерЧтения.Прочитать();
		
		Если Не МенеджерЧтения.Выбран() Тогда
			МенеджерЧтения.Логин="";
			МенеджерЧтения.ТочкаПодключения=ТекущийОбъект.Ссылка;
		КонецЕсли;
		
		ЗначениеВРеквизитФормы(МенеджерЧтения,"УчетныеДанныеПодключения");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ВидПодключения.БезЛогина Тогда
		МенеджерЗаписи=РегистрыСведений.ЦПР_УчетныеДанныеПодключений.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ТочкаПодключения=ТекущийОбъект.Ссылка;
		МенеджерЗаписи.Логин="";
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,УчетныеДанныеПодключения,,"ТочкаПодключения,Логин");
		
		Если не МенеджерЗаписи.ПроверитьЗаполнение() Тогда
			Отказ=Истина;
		КонецЕсли;
		
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	//Если ОБъект.ВидПодключения.БезЛогина Тогда
	//	ПроверяемыеРеквизиты.Добавить("УчетныеДанныеПодключения.Вид");		
	//КонецЕсли;
КонецПроцедуры
